eagletrt/fenice-bms-lv/fenice-bms-lv.ioc
#MicroXplorer Configuration settings - do not modify
PD7.Mode=SD_1_bit
NVIC.CAN1_RX1_IRQn=true\:0\:0\:false\:false\:true\:true\:true
PD12.GPIO_Label=PUMP_2
PC7.GPIOParameters=GPIO_Label
RCC.USART1Freq_Value=108000000
PE11.GPIOParameters=GPIO_Label
FATFS0.BSP.api=Unknown
SPI2.VirtualType=VM_MASTER
VP_FATFS_VS_SDIO.Mode=SDIO
RCC.PLLCLKFreq_Value=216000000
RCC.PLLQCLKFreq_Value=48000000
PC7.Locked=true
PC6.GPIO_Label=BZZR_PWM
PC3.Locked=true
RCC.RTCFreq_Value=32000
PA3.GPIOParameters=GPIO_Label
VP_TIM3_VS_no_output2.Mode=Output Compare2 No Output
PA6.GPIO_Label=FAN3_HV
PD0.Locked=true
PD4.Locked=true
PD2.GPIOParameters=GPIO_Label
RCC.I2SCLockSelection=RCC_I2SCLKSOURCE_PLLI2S
SH.S_TIM4_CH4.ConfNb=1
VP_TIM8_VS_ClockSourceINT.Signal=TIM8_VS_ClockSourceINT
PA2.GPIOParameters=GPIO_Label
PinOutPanel.RotationAngle=0
RCC.MCO1PinFreq_Value=16000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
RCC.PLLSAIUsed=0
RCC.LPTIM1Freq_Value=54000000
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
VP_FATFS_VS_SDIO.Signal=FATFS_VS_SDIO
RCC.I2C4CLockSelection=RCC_I2C4CLKSOURCE_PCLK1
RCC.LCDTFTFreq_Value=12000000
RCC.PLL48CLockSelection=RCC_CLK48SOURCE_PLL
VP_TIM3_VS_no_output2.Signal=TIM3_VS_no_output2
RCC.RCC_MCO2Source=RCC_MCO2SOURCE_HSE
NVIC.CAN1_TX_IRQn=true\:0\:0\:false\:false\:true\:true\:true
RCC.I2C4Freq_Value=54000000
TIM2.IPParameters=Channel-PWM Generation2 CH2,Channel-PWM Generation1 CH1,Channel-PWM Generation3 CH3,Channel-PWM Generation4 CH4
PD4.Signal=GPIO_Output
RCC.APB2TimFreq_Value=216000000
Dma.ADC1.0.Direction=DMA_PERIPH_TO_MEMORY
PC7.Signal=GPIO_Output
PH1/OSC_OUT.Signal=RCC_OSC_OUT
PC3.Signal=SPI2_MOSI
PD0.Signal=CAN1_RX
RCC.SAI2Freq_Value=192000000
VP_TIM3_VS_ControllerModeClock.Mode=Clock Mode
VP_TIM3_VS_ClockSourceITR.Signal=TIM3_VS_ClockSourceITR
Dma.ADC1.0.MemDataAlignment=DMA_MDATAALIGN_WORD
FATFS0.BSP.ip=GPIO
PE14.Locked=true
RCC.I2C3CLockSelection=RCC_I2C3CLKSOURCE_PCLK1
RCC.USART3Freq_Value=54000000
RCC.PLLSAIRCLKFreq_Value=192000000
ProjectManager.ProjectBuild=false
TIM4.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB3.Mode=Trace_Asynchronous_SW
FATFS0.BSP.i2caddr=0
RCC.RTCClockSelection=RCC_RTCCLKSOURCE_LSI
RCC.UART7CLockSelection=RCC_UART7CLKSOURCE_PCLK1
ProjectManager.FirmwarePackage=STM32Cube FW_F7 V1.16.1
MxDb.Version=DB.6.0.21
PB0.GPIOParameters=GPIO_Label
PE15.Locked=true
PA1.GPIOParameters=GPIO_Label
CAN3.Prescaler=3
ProjectManager.BackupPrevious=true
PC4.GPIO_Label=LV_MASTER_RELAY
RCC.SAI1CLockSelection=RCC_SAI1CLKSOURCE_PLLSAI
PB14.Mode=SD_1_bit
PB1.GPIO_Label=T_DCDC24
Dma.ADC1.0.PeriphInc=DMA_PINC_DISABLE
RCC.I2C2CLockSelection=RCC_I2C2CLKSOURCE_PCLK1
SH.ADCx_IN8.0=ADC1_IN8,IN8
PC9.Mode=Clock-out-2
SPI2.CalculateBaudRate=210.937 KBits/s
SH.S_TIM4_CH2.0=TIM4_CH2,PWM Generation2 CH2
PA8.Signal=CAN3_RX
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
CAN3.CalculateTimeQuantum=55.55555555555556
PD3.Mode=Full_Duplex_Master
ProjectManager.HalAssertFull=false
SH.S_TIM8_CH1.ConfNb=1
ADC1.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_3CYCLES
RCC.UART4CLockSelection=RCC_UART4CLKSOURCE_PCLK1
VP_TIM3_VS_ControllerModeClock.Signal=TIM3_VS_ControllerModeClock
RCC.MCO2PinFreq_Value=16000000
CAN1.Prescaler=3
Mcu.Package=LQFP100
PB9.Signal=S_TIM4_CH4
RCC.SDMMCClockSelection=RCC_SDMMC1CLKSOURCE_SYSCLK
PB1.Signal=ADCx_IN9
PA5.Locked=true
SPI2.Mode=SPI_MODE_MASTER
PD12.Signal=S_TIM4_CH1
FATFS0.BSP.solution=PD5
PD5.GPIOParameters=GPIO_Label
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PE12.GPIO_Label=LED_2
RCC.DFSDMFreq_Value=108000000
PA5.GPIOParameters=GPIO_Label
SH.ADCx_IN9.0=ADC1_IN9,IN9
RCC.APB2CLKDivider=RCC_HCLK_DIV2
RCC.UART5CLockSelection=RCC_UART5CLKSOURCE_PCLK1
SH.S_TIM4_CH1.0=TIM4_CH1,PWM Generation1 CH1
RCC.CECFreq_Value=32786.88524590164
RCC.APB1TimFreq_Value=108000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Dma.ADC1.0.FIFOMode=DMA_FIFOMODE_DISABLE
SH.ADCx_IN9.ConfNb=1
PB10.GPIOParameters=GPIO_Label
SH.S_TIM2_CH4.ConfNb=1
RCC.DFSDMAudioFreq_Value=192000000
TIM4.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
PD5.Locked=true
CAN1.CalculateTimeBit=999.99
ProjectManager.CustomerFirmwarePackage=
PC4.GPIOParameters=GPIO_Label
RCC.PLLSAIQCLKFreq_Value=192000000
CAN1.CalculateTimeQuantum=55.55555555555556
PA6.GPIOParameters=GPIO_Label
FATFS0.BSP.STBoard=false
SH.S_TIM4_CH1.ConfNb=1
PA0/WKUP.GPIOParameters=GPIO_Label
RCC.PLLQoutputFreq_Value=48000000
ProjectManager.ProjectFileName=fenice-bms-lv.ioc
RCC.SAI2CLockSelection=RCC_SAI2CLKSOURCE_PLLSAI
Dma.ADC1.0.Instance=DMA2_Stream0
RCC.PLLI2SUsed=0
ADC1.Rank-0\#ChannelRegularConversion=1
Mcu.PinsNb=50
TIM3.AutoReloadPreload=TIM_AUTORELOAD_PRELOAD_ENABLE
ADC1.IPParameters=Rank-0\#ChannelRegularConversion,master,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,NbrOfConversionFlag
CAN1.IPParameters=CalculateTimeQuantum,Prescaler,BS1,BS2,CalculateTimeBit,CalculateBaudRate,SJW
FATFS0.BSP.mode=Input
PD3.Signal=SPI2_SCK
CAN1.CalculateBaudRate=1000000
PC2.Signal=SPI2_MISO
PC6.Signal=S_TIM8_CH1
PB11.GPIO_Label=FAN5_LV
PD13.GPIOParameters=GPIO_Label
PD7.Signal=SDMMC2_CMD
PD1.Signal=CAN1_TX
RCC.UART8Freq_Value=54000000
RCC.APB1CLKDivider=RCC_HCLK_DIV4
PD6.Mode=SD_1_bit
SH.S_TIM2_CH1_ETR.ConfNb=1
RCC.USART6CLockSelection=RCC_USART6CLKSOURCE_PCLK2
RCC.WatchDogFreq_Value=32000
PB8.GPIO_Label=RADIATOR_1
TIM4.IPParameters=Channel-PWM Generation2 CH2,Channel-PWM Generation1 CH1,Channel-PWM Generation3 CH3,Channel-PWM Generation4 CH4
RCC.USART6Freq_Value=108000000
SH.ADCx_IN7.0=ADC1_IN7,IN7
PC6.Locked=true
Dma.ADC1.0.Priority=DMA_PRIORITY_LOW
SH.S_TIM2_CH2.ConfNb=1
PB11.GPIOParameters=GPIO_Label
PB9.Locked=true
VP_TIM8_VS_ClockSourceINT.Mode=Internal
Mcu.Pin48=VP_TIM3_VS_no_output2
Mcu.Pin49=VP_TIM8_VS_ClockSourceINT
Mcu.Pin46=VP_TIM3_VS_ControllerModeClock
Mcu.Pin47=VP_TIM3_VS_ClockSourceITR
PB10.Signal=S_TIM2_CH3
PB14.Signal=SDMMC2_D0
FATFS.BSP.number=1
PA5.Signal=S_TIM2_CH1_ETR
Mcu.Pin40=PB3
Mcu.Pin41=PB4
PE13.GPIOParameters=GPIO_Label
SH.S_TIM8_CH1.0=TIM8_CH1,PWM Generation1 CH1
Mcu.Pin44=VP_FATFS_VS_SDIO
Mcu.Pin45=VP_SYS_VS_Systick
Mcu.Pin42=PB8
TIM8.AutoReloadPreload=TIM_AUTORELOAD_PRELOAD_ENABLE
Mcu.Pin43=PB9
ProjectManager.LastFirmware=true
PD1.Mode=CAN_Activate
CAN3.CalculateTimeBit=1055.55
PE14.Signal=GPIO_Output
PE15.Signal=GPIO_Output
Mcu.Pin37=PD5
Mcu.Pin38=PD6
Mcu.Pin35=PD3
RCC.I2C1Freq_Value=54000000
Mcu.Pin36=PD4
RCC.PLLI2SPCLKFreq_Value=192000000
Mcu.Pin39=PD7
FATFS0.BSP.i2creg=
RCC.RNGFreq_Value=48000000
Mcu.Pin30=PA13
PA1.GPIO_Label=FAN1_HV
RCC.EthernetFreq_Value=216000000
Mcu.Pin33=PD1
TIM3.IPParameters=Channel-PWM Generation1 CH1,AutoReloadPreload,Channel-Output Compare2 No Output
PA0/WKUP.GPIO_Label=FDBK_DCDC_12V
Mcu.Pin34=PD2
Mcu.Pin31=PA14
Mcu.Pin32=PD0
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
SH.S_TIM2_CH3.ConfNb=1
PA13.Mode=Trace_Asynchronous_SW
ProjectManager.FreePins=false
RCC.PLLI2SQCLKFreq_Value=192000000
Mcu.Pin26=PC9
Mcu.Pin27=PA8
Mcu.Pin24=PC6
ProjectManager.UnderRoot=false
PE13.Locked=true
Mcu.Pin25=PC7
CAN1.SJW=CAN_SJW_2TQ
TIM8.Period=43
Mcu.Pin28=PA11
PC7.GPIO_Label=LED_ERR
Mcu.Pin29=PA12
PB4.Locked=true
Mcu.Pin22=PD12
Mcu.Pin23=PD13
Mcu.Pin20=PB11
ADC1.master=1
PA3.Locked=true
PE13.GPIO_Label=LED_3
Mcu.Pin21=PB14
RCC.USART1CLockSelection=RCC_USART1CLKSOURCE_PCLK2
PA5.GPIO_Label=FAN2_HV
NVIC.ForceEnableDMAVector=true
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.CompilerOptimize=6
TIM3.Channel-Output\ Compare2\ No\ Output=TIM_CHANNEL_2
PA11.Signal=UART4_RX
SH.S_TIM2_CH1_ETR.0=TIM2_CH1,PWM Generation1 CH1
ProjectManager.HeapSize=0x200
Mcu.Pin15=PE12
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PE13
Mcu.Pin13=PB1
Mcu.Pin14=PE11
Mcu.Pin19=PB10
SH.S_TIM3_CH1.ConfNb=1
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PE14
Mcu.Pin18=PE15
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PC4
Mcu.Pin12=PB0
Mcu.Pin10=PA7
PA8.Mode=CAN_Activate
RCC.USART2CLockSelection=RCC_USART2CLKSOURCE_PCLK1
SPI2.DataSize=SPI_DATASIZE_8BIT
PE12.GPIOParameters=GPIO_Label
PD2.Signal=GPIO_Output
RCC.I2C2Freq_Value=54000000
RCC.SDMMC2Freq_Value=48000000
PD1.Locked=true
PB0.Signal=ADCx_IN8
PA7.GPIOParameters=GPIO_Label
RCC.USART3CLockSelection=RCC_USART3CLKSOURCE_PCLK1
PD2.GPIO_Label=SDMMC2_CS
FATFS0.BSP.name=Detect_SDIO
NVIC.CAN1_RX0_IRQn=true\:0\:0\:false\:false\:true\:true\:true
Mcu.Family=STM32F7
PC3.Mode=Full_Duplex_Master
ProjectManager.MainLocation=Core/Src
SH.S_TIM4_CH2.ConfNb=1
RCC.SAI1Freq_Value=192000000
RCC.CortexFreq_Value=216000000
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F765VGTx
FATFS0.BSP.semaphore=
PE11.GPIO_Label=LED_1
SH.ADCx_IN2.0=ADC1_IN2,IN2
TIM8.Pulse-PWM\ Generation1\ CH1=21
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-SystemClock_Config-RCC-false-HAL-false,4-MX_ADC1_Init-ADC1-false-HAL-true,5-MX_CAN1_Init-CAN1-false-HAL-true,6-MX_CAN3_Init-CAN3-false-HAL-true,7-MX_SDMMC2_SD_Init-SDMMC2-false-HAL-true,8-MX_SPI2_Init-SPI2-false-HAL-true,9-MX_TIM2_Init-TIM2-false-HAL-true,10-MX_TIM3_Init-TIM3-false-HAL-true,11-MX_TIM4_Init-TIM4-false-HAL-true,12-MX_TIM8_Init-TIM8-false-HAL-true,13-MX_FATFS_Init-FATFS-false-HAL-false,14-MX_UART4_Init-UART4-false-HAL-true,0-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true
PA11.Mode=Asynchronous
PA0/WKUP.Signal=GPIO_Input
PB0.GPIO_Label=T_DCDC12
RCC.PLLI2SRCLKFreq_Value=192000000
RCC.USART2Freq_Value=54000000
PD2.Locked=true
TIM2.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
PB11.Signal=S_TIM2_CH4
ProjectManager.StackSize=0x400
RCC.I2C3Freq_Value=54000000
PD13.Signal=S_TIM4_CH2
Mcu.IP4=DMA
Mcu.IP5=FATFS
RCC.FCLKCortexFreq_Value=216000000
Mcu.IP2=CAN3
PD13.Locked=true
Mcu.IP3=CORTEX_M7
Mcu.IP0=ADC1
Mcu.IP1=CAN1
PA12.Signal=UART4_TX
Mcu.UserConstants=
RCC.SDMMCFreq_Value=216000000
Mcu.ThirdPartyNb=0
PH0/OSC_IN.Mode=HSE-External-Oscillator
RCC.HCLKFreq_Value=216000000
SH.ADCx_IN3.0=ADC1_IN3,IN3
TIM8.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
Mcu.IPNb=16
RCC.PLLI2SRoutputFreq_Value=192000000
ProjectManager.PreviousToolchain=
RCC.SPDIFRXFreq_Value=192000000
PA0/WKUP.Locked=true
SH.ADCx_IN3.ConfNb=1
SH.ADCx_IN7.ConfNb=1
Mcu.Pin6=PA2
Mcu.Pin7=PA3
NVIC.DMA2_Stream0_IRQn=true\:0\:0\:false\:false\:true\:false\:true
Mcu.Pin8=PA5
Mcu.Pin9=PA6
NVIC.CAN1_SCE_IRQn=true\:0\:0\:false\:false\:true\:true\:true
RCC.VCOSAIOutputFreq_Value=384000000
RCC.AHBFreq_Value=216000000
SPI2.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_256
Mcu.Pin0=PH0/OSC_IN
Mcu.Pin1=PH1/OSC_OUT
TIM3.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
TIM8.IPParameters=Channel-PWM Generation1 CH1,Prescaler,Period,AutoReloadPreload,Pulse-PWM Generation1 CH1
GPIO.groupedBy=Group By Peripherals
CAN3.BS2=CAN_BS2_2TQ
Mcu.Pin2=PC2
Mcu.Pin3=PC3
Mcu.Pin4=PA0/WKUP
Mcu.Pin5=PA1
CAN3.BS1=CAN_BS1_16TQ
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_2
RCC.HSE_VALUE=16000000
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP10=SYS
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
Mcu.IP12=TIM3
RCC.RCC_MCO1Source=RCC_MCO1SOURCE_HSI
Mcu.IP11=TIM2
Mcu.IP14=TIM8
PB4.Mode=CAN_Activate
Mcu.IP13=TIM4
PE13.Signal=GPIO_Output
Mcu.IP15=UART4
RCC.VCOInputFreq_Value=2000000
PA14.Mode=Trace_Asynchronous_SW
File.Version=6
CAN3.IPParameters=CalculateTimeQuantum,Prescaler,BS1,BS2,CalculateTimeBit,CalculateBaudRate
PB8.Locked=true
TIM2.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
SH.S_TIM3_CH1.0=TIM3_CH1,PWM Generation1 CH1
VP_TIM3_VS_ClockSourceITR.Mode=TriggerSource_ITR0
PH1/OSC_OUT.Mode=HSE-External-Oscillator
Dma.RequestsNb=1
PB0.Locked=true
ProjectManager.ProjectName=fenice-bms-lv
RCC.FLatency-AdvancedSettings=FLASH_LATENCY_7
PD13.GPIO_Label=PUMP_1
PA6.Signal=S_TIM3_CH1
PA7.Locked=true
PD5.GPIO_Label=SD_DETECT
ProjectManager.ToolChainLocation=
PA2.GPIO_Label=CURRENT_SENSOR
RCC.LSI_VALUE=32000
TIM8.Prescaler=10799
RCC.CECClockSelection=RCC_CECCLKSOURCE_HSI
PC4.Locked=true
SPI2.Direction=SPI_DIRECTION_2LINES
PD6.Signal=SDMMC2_CK
Dma.Request0=ADC1
PE12.Locked=true
PB4.Signal=CAN3_TX
PA3.Signal=ADCx_IN3
PA2.Locked=true
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
TIM4.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
RCC.I2SFreq_Value=192000000
TIM2.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
PB8.GPIOParameters=GPIO_Label
RCC.UART7Freq_Value=54000000
PE14.GPIOParameters=GPIO_Label
PB9.GPIO_Label=RADIATOR_2
ProjectManager.NoMain=false
SH.S_TIM4_CH4.0=TIM4_CH4,PWM Generation4 CH4
RCC.PLLRFreq_Value=216000000
RCC.I2C1CLockSelection=RCC_I2C1CLKSOURCE_PCLK1
RCC.UART8CLockSelection=RCC_UART8CLKSOURCE_PCLK1
PC4.Signal=GPIO_Output
RCC.EXTERNAL_CLOCK_VALUE=12288000
ProjectManager.DefaultFWLocation=true
PC2.Mode=Full_Duplex_Master
PE14.GPIO_Label=LED_4
PD5.Signal=GPIO_Input
ProjectManager.DeletePrevious=true
PB10.Locked=true
RCC.FamilyName=M
PE15.GPIOParameters=GPIO_Label
PB9.GPIOParameters=GPIO_Label
PD12.Locked=true
FATFS0.BSP.instance=PD5
PA13.Signal=SYS_JTMS-SWDIO
SH.S_TIM2_CH2.0=TIM2_CH2,PWM Generation2 CH2
Dma.ADC1.0.PeriphDataAlignment=DMA_PDATAALIGN_WORD
PE15.GPIO_Label=LED_5
CAN1.BS2=CAN_BS2_5TQ
PD12.GPIOParameters=GPIO_Label
CAN1.BS1=CAN_BS1_12TQ
ProjectManager.TargetToolchain=Makefile
PB10.GPIO_Label=FAN6_LV
FATFS0.BSP.condition=
Dma.ADC1.0.Mode=DMA_NORMAL
SH.S_TIM4_CH3.0=TIM4_CH3,PWM Generation3 CH3
RCC.LPTIM1CLockSelection=RCC_LPTIM1CLKSOURCE_PCLK
RCC.SDMMC2ClockSelection=RCC_SDMMC2CLKSOURCE_CLK48
SPI2.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler,DataSize
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=48000000
RCC.PLLSAIoutputFreq_Value=192000000
PE11.Signal=GPIO_Output
RCC.LSE_VALUE=32768
PD3.Locked=true
PA1.Signal=S_TIM2_CH2
CAN3.CalculateBaudRate=947368
PB1.Locked=true
SH.S_TIM4_CH3.ConfNb=1
RCC.VCOI2SOutputFreq_Value=384000000
RCC.PLLSAIPCLKFreq_Value=192000000
board=custom
RCC.VCOOutputFreq_Value=432000000
Dma.ADC1.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode
PH0/OSC_IN.Signal=RCC_OSC_IN
TIM4.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
RCC.APB2Freq_Value=108000000
RCC.UART4Freq_Value=54000000
MxCube.Version=6.2.1
SH.S_TIM2_CH3.0=TIM2_CH3,PWM Generation3 CH3
PD4.GPIO_Label=SPI2_CS
SH.ADCx_IN2.ConfNb=1
VP_SYS_VS_Systick.Mode=SysTick
PD4.GPIOParameters=GPIO_Label
TIM2.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
SH.ADCx_IN8.ConfNb=1
RCC.UART5Freq_Value=54000000
RCC.IPParameters=AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2CLKDivider,APB2Freq_Value,APB2TimFreq_Value,CECClockSelection,CECFreq_Value,CortexFreq_Value,DFSDMAudioFreq_Value,DFSDMFreq_Value,EXTERNAL_CLOCK_VALUE,EthernetFreq_Value,FCLKCortexFreq_Value,FLatency-AdvancedSettings,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI_VALUE,I2C1CLockSelection,I2C1Freq_Value,I2C2CLockSelection,I2C2Freq_Value,I2C3CLockSelection,I2C3Freq_Value,I2C4CLockSelection,I2C4Freq_Value,I2SCLockSelection,I2SFreq_Value,LCDTFTFreq_Value,LPTIM1CLockSelection,LPTIM1Freq_Value,LSE_VALUE,LSI_VALUE,MCO1PinFreq_Value,MCO2PinFreq_Value,PLL48CLockSelection,PLLCLKFreq_Value,PLLI2SPCLKFreq_Value,PLLI2SQCLKFreq_Value,PLLI2SRCLKFreq_Value,PLLI2SRoutputFreq_Value,PLLI2SUsed,PLLM,PLLN,PLLQ,PLLQCLKFreq_Value,PLLQoutputFreq_Value,PLLRFreq_Value,PLLSAIPCLKFreq_Value,PLLSAIQCLKFreq_Value,PLLSAIRCLKFreq_Value,PLLSAIUsed,PLLSAIoutputFreq_Value,PLLSourceVirtual,RCC_MCO1Source,RCC_MCO2Source,RNGFreq_Value,RTCClockSelection,RTCFreq_Value,SAI1CLockSelection,SAI1Freq_Value,SAI2CLockSelection,SAI2Freq_Value,SDMMC2ClockSelection,SDMMC2Freq_Value,SDMMCClockSelection,SDMMCFreq_Value,SPDIFRXFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,UART4CLockSelection,UART4Freq_Value,UART5CLockSelection,UART5Freq_Value,UART7CLockSelection,UART7Freq_Value,UART8CLockSelection,UART8Freq_Value,USART1CLockSelection,USART1Freq_Value,USART2CLockSelection,USART2Freq_Value,USART3CLockSelection,USART3Freq_Value,USART6CLockSelection,USART6Freq_Value,USBFreq_Value,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAIOutputFreq_Value,WatchDogFreq_Value
PE11.Locked=true
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F765V(G-I)Tx
PD0.Mode=CAN_Activate
PE12.Signal=GPIO_Output
PA2.Signal=ADCx_IN2
Mcu.IP8=SDMMC2
Mcu.IP9=SPI2
Mcu.IP6=NVIC
Mcu.IP7=RCC
ProjectManager.CoupleFile=true
PB3.Signal=SYS_JTDO-SWO
RCC.SYSCLKFreq_VALUE=216000000
PA7.GPIO_Label=T_BATT2
PA12.Mode=Asynchronous
KeepUserPlacement=false
PA14.Signal=SYS_JTCK-SWCLK
Dma.ADC1.0.MemInc=DMA_MINC_ENABLE
SH.S_TIM2_CH4.0=TIM2_CH4,PWM Generation4 CH4
PC6.GPIOParameters=GPIO_Label
RCC.HSI_VALUE=16000000
RCC.PLLQ=9
ADC1.NbrOfConversionFlag=1
FATFS0.BSP.component=
RCC.PLLM=8
RCC.PLLN=216
PB8.Signal=S_TIM4_CH3
PC9.Signal=RCC_MCO_2
RCC.APB1Freq_Value=54000000
PB11.Locked=true
ProjectManager.DeviceId=STM32F765VGTx
ProjectManager.LibraryCopy=0
PA3.GPIO_Label=T_BATT1
PB1.GPIOParameters=GPIO_Label
PA7.Signal=ADCx_IN7
